export const tooltipInfo: { [key: string]: React.ReactNode } = {
  현금비중: (
    <>
      <b>한 기업의 주식 총액</b>을 말해요.
      <br />
      현재 시장에서 형성되고있는 기업의 가치에요.
      <br />
      계산법은 &apos;주식 가격 × 발행된 주식 수&apos;랍니다.
      <br />
      시가총액이 높으면 큰 회사이고, 낮으면 상대적으로 작은 회사일 가능성이
      커요.
    </>
  ),
  매매횟수: (
    <>
      <b>주식이 사고팔린 전체 금액</b>이에요.
      <br />
      특정 기간 동안 주식 시장에서 얼마나 많은 돈이 오갔는지를 보여줘요.
      <br />
      누적거래대금이 크면 사람들이 그 주식을 많이 사고판다는 뜻이고, 적으면
      거래가 활발하지 않다는 뜻이에요.
    </>
  ),
  안정성: (
    <>
      <b>상장주식수는 주식시장에서 거래될 수 있는 전체 주식 수</b>를 말해요.
      <br />
      기업이 주식 시장에 내놓은 주식의 양을 나타내요.
      <br />
      높으면 그만큼 많은 사람들이 투자할 수 있어요.
      <br />
      주식 수가 많으면 주가 변동이 상대적으로 안정될 수 있어요.
    </>
  ),
  "거래량 회전률": (
    <>
      거래량 회전률은 주식의 거래가 얼마나 활발하게 이뤄졌는지 보여줘요.
      <br />
      &apos;상장주식 수 대비 얼마나 많은 주식이 거래되었나?&apos;를 뜻해요.
      <br />
      높을수록 거래가 자주 이뤄지고 있다는 의미예요.
    </>
  ),
  "52주 최고가": (
    <>
      지난 52주(1년) 동안 해당 주식의 가장 높은 가격을 말해요.
      <br />
      이 수치는 투자자들이 주식의 최근 성과를 파악하는 데 도움이 돼요.
      <br />
      52주 최고가가 높으면 최근에 주식이 인기가 많았다는 뜻이고, 주가가 많이
      올랐을 가능성이 커요.
    </>
  ),
  "52주 최저가": (
    <>
      지난 52주(1년) 동안 주식의 가장 낮은 가격을 의미해요.
      <br />
      52주 최저가가 낮으면 그 주식이 최근에 인기가 없었거나, 주가가 하락했던
      시점이 있었다는 의미예요.
    </>
  ),
}
